package 存檔練習_觀音32籤;

import java.io.Serializable;
import java.util.ArrayList;

public class 觀音靈課Data  implements Serializable {
     ArrayList<觀音靈課_Model> 觀音靈課資料 = new ArrayList<觀音靈課_Model>();

    public ArrayList<觀音靈課_Model> get觀音靈課資料() {
        return 觀音靈課資料;
    }

    public void 建檔() {
        觀音靈課_Model 單一卦資料 = new 觀音靈課_Model();
        String[][] newdatas = {
                { "1","昇進卦","上上","金木水火土","彩鳳臨丹闕。靈龜降吉祥。禍除福祿至。喜氣自洋洋。","此卦求財大吉。正宜出入歡娛。官詞口舌並消除。病人起離床席。求官目下成就。行人早晚還歸。禍除災散福盈餘。最喜高明富貴。"},
                { "2","從革卦","上上","金○○○○","舊跡宜更改。新事好進程。龍門魚化躍。凡骨作神靈。","此卦求財大利。謀望定有歸期。病人痊瘥離床席。凡事經營有理。行人還家立事。在外必有食衣。春來花發更何疑。幹事百無阻滯。"},
                { "3","曲直卦","中平","○木○○○","動用因風便。求財可託人。喜逢戊己曰。幹事得完成。","此卦求財微細。病人不保朝夕。行人出外定延遲。官事經營無理。所求不得成就。謀望難稱心機。時來雨霽自光輝。佇看先憂後喜。"},
                { "4","潤下卦","中上","○○水○○","船泛江湖內。難求獲寶珠。更宜進大用。福至禍災除。","此卦心憂頓解。所求百事不成。只宜進步獲康寧。投托高人有慶。恰似寒爐發焰。猶如枯木逢春。更宜雨過散浮雲。放出一輪明鏡。"},
                { "5","炎火卦","中平","○○○火○","兇卦按南方。烈火不可當。爭訟文書滯。時間有小殃。","此卦多懷恐懼。常常猶豫心頭。進之有喜退之憂。目下且宜守舊。苑內有花凋謝。黃菊直到新秋。時來運至莫懷愁。不久自然成就。"},
                { "6","稼穡卦","中平","○○○○土","戊已本居中。先憂後喜逢。夫子值陳厄。目下不和通。","此卦凡事阻礙。先需破散錢財。行人在外未回來。病者難得痊瘥。所求未獲成就。莫憂運拙時乖。且需謹慎目前災。向後永無禍害。"},
                { "7","進遠卦","上上","金木○○○","門戶興安泰。錢財漸漸昌。進身求望吉。疾病得安康。","此卦求財遂意。所干宜用庚申。行人在外獲珍珍。病來百無所損。官事口舌有理。最喜成就婚姻。高人一見便歡欣。福祿重重有準。"},
                { "8","得助卦","上上","金○水○○","所干蒙天佑。門招百福臻。貴人相助力。獲福盡歡欣。","此卦辛入癸水。陰中貴人扶持。求官定著紫羅衣。行人出外獲利。爐內明焚香火。空中暗助神祗。子孫團聚盡欣嬉。所求遂心如意。"},
                { "9","獲安卦","中上","金○○火○","目下如冬樹。枯衰未放花。看看春色動。 一發盡生芽。","此卦心多猶豫。先憂後喜無疑。行人在外錦衣歸。疾病淹纏遲滯。婚姻和合榮顯。官事豈有參差。恰如花柳鬥芳菲。目下與人和氣。"},
                {"10","隨心卦","上上","金○○○土","春日融和氣。衰殘物再興。更逢微細雨。德澤又還生。","此卦求財吉利。行人衣錦還家。婚姻和合併無差。口舌是非都罷。一旦加官進祿。稱心富貴榮華。今生再種福田芽。來世堆金無價。"},
                {"11","百達卦","上上","○木水○○","災散禍門閉。喜慶福門開。目前相逢處。須當得橫財。","此卦上和下睦。自然喜慶無憂。更宜四遠把財求。名利隨心成就。旱苗忽逢甘雨。順風好駕孤舟。一江春水向東流。百事安然無咎。"},
                {"12","安吉卦","上上","○木○火○","進用多隨意。寒儒衣錦歸。前程春風霽。散步賞芳菲。","此卦進用吉兆。唯宜拜相封候。貴人接引上高樓。合得金章紫綬。財利求來百倍。行人稱意無憂。一輪明月正當秋。照徹乾坤宇宙。"},
                {"13","舉進卦","下下","○木○○土","水中現明月。見影不見形。錢財多失散。謹慎得安寧。","此卦申克戊已。幹事堪嘆難成。敗財損物失人情。莫與小人爭競。萬事不宜守舊。動進方有期程。好將香火供神靈。可保時中吉慶。"},
                {"14","安靜卦","中平","○○水火○","動用不安寧。經營事不成。退身方可吉。守分禍潛形。","此卦只宜守舊。迴避不可張羅。謹身節用得安和。隨分隨緣且過。若要堆金積玉。恰如一枕南柯。好從靜處念彌陀。禳度解除災禍。"},
                {"15","阻隔卦","下下","○○水○土","衰木逢春少。孤舟遇大風。動身無所託。百事不亨通。","此卦繁興阻隔。謀望不遂心頭。只宜守舊在林丘。愁慮更逢多咎。莫望加官進祿。休思寶馬輕裘。但行平等莫剛求。祈禱神天護祐。"},
                {"16","消厄卦","上上","○○○火土","日出照四海。光輝天下明。進身和合吉。百事自然成。","此卦丙已無戰。自然百事安康。不宜守舊進前昌。行人在外無障。爭訟官詞有理。求財遂意禎祥。看經念佛保安康。滾滾公侯榮望。"},
                {"17","至喜卦","中上","金木水○○","病散身安泰。官事只可和。前程宜守舊。災禍自消磨。","此卦剛柔之兆。凡事只可諧和。伏低作小莫爭他。忍者消除災禍。君子時乖運拙。小得逞僂儸。黃花直至正秋過。自有清香遠播。"},
                {"18","猶豫卦","下下","金木○○土","此卦恍惚多。財帛暗消磨。婚姻反成害。人事不諧和。","此卦凡事不遂。經營未決憂愁。受恩深處反為仇。提防小人爭鬥。口舌且須謹慎。名利莫苦貪求。秋來雨過五云收。明月光輝宇宙。"},
                {"19","豐稔卦","上上","金○水火○","豐富時時進。錢財格格高。松筠欺雪露。蘭檜出蓬蒿。","此卦三星將濟。年豐物富家豪。凡當謀望轉增高。出外行人即到。疾病不醫自好。是非口舌潛消。若能念佛不辭勞。像簡烏靴紗帽。"},
                {"20","得祿卦","上上","金○水○土","高明居祿位。籠禽得放生。動容招財寶。更宜向遠行。","此卦只宜升進。不可守舊延遲。命中合著紫羅衣。遠投高人有喜。求財遂心滿願。幹事莫得狐疑。謝天謝地謝神祗。孚佑重重喜氣。"},
                {"21","福祿卦","上上","○木水火○","福祿得高強。聲名自進昌。遂心獲大吉。萬里好風光。","此卦進用之兆。禍退福至無涯。求財稱意恣奢華。錦繡雕鞍駿馬。所望無不從願。行人衣錦還家。三十二卦最為誇。福祿增崇者也。"},
                {"22","明顯卦","上上","金○○火土","明月正當天。清光午夜圓。纖毫雲翳息。萬里得凝然。","此卦先前暗昧。於今皆已分明。求財幹辦好經營。下水張帆風正。官事口舌消滅。病人漸得身輕。爐香熱處紫煙生。眷屬安然吉慶。"},
                {"23","凝滯卦","下下","○木水○土","贏刀登途遠。飢人去路長。進身皆不吉。凡事可消祥。","此卦阻隔之兆。凡事所干遲延。不宜出外離家緣。欲要求財難見。口舌翻成官事。提防疾病牽纏。若求安穩免災愆。預告神靈方便。"},
                {"24","榮顯卦","上上","○木○火土","三傢俱養性。始元得共生。果隨心造化。萬事自然成。","此卦榮旺之兆。行藏盡用堪為。所求之事應心機。成就萬無一失。病者即時痊癒。官詞勿慮無疑。求財謀望最堪宜。動止施為亨利。"},
                {"25","福厚卦","上上","○○水火土","離別重相見。不知事盡通。所求皆隨意。身樂得從容。","此卦相生之兆。凡為吉慶無虞。安然快樂自寬舒。和合賞心絕慮。買賣經營無阻。是非口舌消除。行人出處數年餘。今日歡迎會聚。"},
                {"26","永成卦","上上","金木○火○","年來少災害。先祖積陰騭。若言幹辦事。皇天相助力。","此卦一切成就。更堪百事亨通。家門興旺永無窮。抱德正宜進用。行人不久當至。病人體態窮通。是非口舌盡消鎔。禍去福來遠永。"},
                {"27","歲稔卦","上上","○木水火土","霖雨禾苗潤。何愁不廣收。隨心得所以。無喜亦無憂。","此卦猶如冬樹。看看際遇新春。枯枝得雨再芳芬。群卉悉皆萌潤。九橫三災殄散。百非萬禍離門。榮華富貴恣歡欣。絕勝增奇利順。"},
                {"28","開發卦","上上","金木○火土","蚌中珠自現。石內玉爭妍。進身求望吉。凡庶作神仙。","此卦諧和之兆。命中祿位遷高。烏靴像簡紫羅袍。寶馬金槍夾道。佔病早獲痊癒。求財即得豐饒。修心念佛志堅高。散慮逍遙絕惱。"},
                {"29","天祿卦","上上","金木水火○","征戰逢威力。旌旗引駕歸。功成名位就。門戶見光輝。","此卦凡事大吉。命中天祿乘除。動容喜得貴人扶。官位聲名高舉。福至重重有據。災消寂寂無餘。身安心樂且寬舒。積玉堆金滿庫。"},
                {"30","後喜卦","中平","金○水火土","離水得到岸。過橋獲度安。重重憂險阻。蕩蕩自心寬。","此卦心懷憂慮。所求未得自然。求官進相望高遷。不見隨心滿願。自覺重重有阻。誰知漸漸當權。佇看錦色耀重添。官祿增崇榮顯。"},
                {"31","遲滯卦","下下","金木水○土","迢迢途路遠。看看日墜山。憂心無可托。所作事艱難。","此卦凡事遲滯。猶如車陷淤泥。程遙路遠日沈西。無托無依無濟。投托少逢相識。求財不見毫釐。不如聞早念阿彌。自有神天孚庇。"},
                {"32","絕跡卦","下下","○○○○○","塵暗秦時鏡。珉含卞氏瓊。如屈石窯內。何日見光明。","此卦憂疑之兆。所為暗昧不明。只宜守舊不宜行。口舌是非災病。一切所求不遂。百般謀望難成。不如向善早看經。免致磨磚作鏡。"}};
        for (int i = 0; i < newdatas.length; i++) {
             單一卦資料 = new 觀音靈課_Model();
            單一卦資料.set資料(  Integer.valueOf(newdatas[i][0]),newdatas[i][1], newdatas[i][2], newdatas[i][3], newdatas[i][4], newdatas[i][5] );
            觀音靈課資料.add(單一卦資料);
        }
    }


}
